OlegAushev/mcudrv/f2837xd/adc/mcu_adc.h
#pragma once


#include <emb_c28x/emb_array.h>
#include <emb_c28x/emb_core.h>
#include <mcu/adc_channels/mcu_adcchannels.h>
#include <mcu_c28x/f2837xd/system/mcu_system.h>
#include "driverlib.h"
#include "device.h"


namespace mcu {

namespace adc {

SCOPED_ENUM_DECLARE_BEGIN(Peripheral)
{
	adca,
	adcb,
	adcc,
	adcd
}
SCOPED_ENUM_DECLARE_END(Peripheral)


const size_t peripheral_count = 4;


struct Config
{
	uint32_t sample_window_ns;
};


namespace impl {

struct Module
{
	uint32_t base;
	uint32_t result_base;
	Module(uint32_t base_, uint32_t result_base_)
		: base(base_), result_base(result_base_) {}
};


extern const uint32_t adc_bases[4];
extern const uint32_t adc_result_bases[4];
extern const uint16_t adc_pie_int_groups[4];


struct Channel
{
	Peripheral peripheral;
	ADC_Channel channel;
	ADC_SOCNumber soc;
	ADC_Trigger trigger;
	bool registered;
	Channel() { registered = false; }
	Channel(Peripheral peripheral_, ADC_Channel channel_, ADC_SOCNumber soc_, ADC_Trigger trigger_)
		: peripheral(peripheral_)
		, channel(channel_)
		, soc(soc_)
		, trigger(trigger_)
	{ registered = false; }
};


struct Irq
{
	Peripheral peripheral;
	ADC_IntNumber int_num;
	ADC_SOCNumber soc;
	uint32_t pie_int_num;
	bool registered;
	Irq() { registered = false; }
	Irq(Peripheral peripheral_, ADC_IntNumber int_num_, ADC_SOCNumber soc_, uint32_t pie_int_num_)
		: peripheral(peripheral_)
		, int_num(int_num_)
		, soc(soc_)
		, pie_int_num(pie_int_num_)
	{ registered = false; }
};


void init_channels(emb::Array<impl::Channel, ChannelName::count>& channels);


void init_irqs(emb::Array<impl::Irq, IrqName::count>& irqs);

} // namespace impl


class Module : public emb::c28x::interrupt_invoker_array<Module, peripheral_count>, private emb::noncopyable
{
	friend class Channel;
private:
	const Peripheral _peripheral;
	impl::Module _module;
	const uint32_t sample_window_cycles;

	static emb::Array<impl::Channel, ChannelName::count> _channels;
	static emb::Array<impl::Irq, IrqName::count> _irqs;
	static bool _channels_and_irqs_initialized;
public:
	Module(Peripheral peripheral, const adc::Config& config);
	void start(ChannelName channel)
	{
		ADC_forceSOC(_module.base, _channels[channel.underlying_value()].soc);
	}

	uint16_t read(ChannelName channel) const
	{
		return ADC_readResult(_module.result_base, _channels[channel.underlying_value()].soc);
	}

	void enable_interrupts()
	{
		for (size_t i = 0; i < IrqName::count; ++i)
		{
			Interrupt_enable(_irqs[i].pie_int_num);
		}
	}

	void disable_interrupts()
	{
		for (size_t i = 0; i < IrqName::count; ++i)
		{
			Interrupt_disable(_irqs[i].pie_int_num);
		}
	}

	void register_interrupt_handler(IrqName irq, void (*handler)(void))
	{
		Interrupt_register(_irqs[irq.underlying_value()].pie_int_num, handler);
	}

	void acknowledge_interrupt(IrqName irq)
	{
		ADC_clearInterruptStatus(_module.base, _irqs[irq.underlying_value()].int_num);
		Interrupt_clearACKGroup(impl::adc_pie_int_groups[_irqs[irq.underlying_value()].int_num]);
	}

	bool interrupt_pending(IrqName irq) const
	{
		return ADC_getInterruptStatus(_module.base, _irqs[irq.underlying_value()].int_num);
	}

	void clear_interrupt_status(IrqName irq)
	{
		ADC_clearInterruptStatus(_module.base, _irqs[irq.underlying_value()].int_num);
	}
};


class Channel
{
public:
	Module* adc;
private:
	ChannelName _channel;
public:
	Channel()
		: adc(static_cast<Module*>(NULL))
		, _channel(ChannelName::count)	// dummy write
	{}

	Channel(ChannelName channel)
	{
		init(channel);
	}

	void init(ChannelName channel)
	{
		_channel = channel;

		assert(Module::_channels_and_irqs_initialized);
		assert(Module::_channels[channel.underlying_value()].registered);

		if (Module::_channels_and_irqs_initialized
				&& Module::_channels[channel.underlying_value()].registered)
		{
			adc = Module::instance(Module::_channels[channel.underlying_value()].peripheral.underlying_value());
		}
		else
		{
			adc = static_cast<Module*>(NULL);
		}
	}

	void start() { adc->start(_channel); }
	uint16_t read() const {	return adc->read(_channel); }
};

} // namespace adc

} // namespace mcu

